[
     
    {
        "image": "journals/articleCovers/njzArticleCover.webp",
        "title": "K-Pop Group NewJeans Faces New Uncertainty After Member Is Dropped",
        "summary": "The band’s label said it had dropped one of the girl group’s five members. NewJeans’s legal battle has drawn public scrutiny of the K-pop industry..",
        "author": "Jin Yu Young",
        "link": "https://www.nytimes.com/2025/12/30/world/asia/new-jeans-danielle-ador.html"

    },
    {
        "image": "journals/articleCovers/winterxjungkook.jpg",
        "title": "Amid BTS Jungkook dating rumours, aespa's Winter celebrates her birthday; posts 'red heart' photos on Instagram",
        "summary": "aespa's Winter rang in the new year - and her birthday - with a series of intimate Instagram posts that quickly set social media buzzing. Born in 2001, the K-pop star turned 25 on January 1, sharing moments that felt celebratory, personal, and quietly confident, even as old dating rumours involving BTS' Jungkook resurfaced online...",
        "author": "Karen Noronha",
        "link": "https://www.msn.com/en-in/entertainment/news/amid-bts-jungkook-dating-rumours-aespa-s-winter-celebrates-her-birthday-posts-red-heart-photos-on-instagram/ar-AA1TvKYT?ocid=BingNewsSerp"

    },
    {
        "image": "journals/articleCovers/cortis-fashion-1024x683.jpg",
        "title": "Did They Go Too Far? Cortis Slammed for Talking About Kissing and Dating on Live Broadcast",
        "summary": "Rookie K-pop boy group Cortis faces backlash after members discussed romance and kissing during a live stream, prompting their manager to abruptly step in....",
        "author": "tule",
        "link": "https://kbizoom.com/cortis-live-broadcast-romance-controversy/"

    },
    {
        "image": "journals/articleCovers/katseye-group-pic (2).jpg",
        "title": "KATSEYE's 'Gabriela' Soars To New Peak On Billboard Hot 100 As 'Gnarly' Re-Enters Chart",
        "summary": "On January 6 local time, Billboard revealed that KATSEYE’s hit single “Gabriela” had jumped to a new peak of No. 22 in its 24th week on the Hot 100, which ranks the most popular songs in the United States....",
        "author": "E Cha",
        "link": "https://www.soompi.com/article/1810376wpp/katseyes-gabriela-soars-to-new-peak-on-billboard-hot-100-as-gnarly-re-enters-chart"

    },
    {
        "image": "journals/articleCovers/blackpinkRose.jpg",
        "title": "Blackpink Rosé visits Seoul hospital to encourage young patients",
        "summary": "Blackpink Rosé visited Seoul National University Children's Hospital and offered encouragement to the young patients....",
        "author": "Osen",
        "link": "https://biz.chosun.com/en/en-entertainment/2025/12/31/B7FBJRKMI5E2XAVP7MBPHDB3FA/"
        
    },
    {
        "image": "journals/articleCovers/theboyzAgency.jpg",
        "title": "The Boyz Unveil New Agency Profile",
        "summary": "On December 16, OneHundred released The Boyz's updated profile photos along with a statement: 'The Boyz have officially joined our agency and will begin their new activities with us'....",
        "author": "Dispatch Dipe",
        "link": "https://www.dipe.co.kr/2313859"

    }
]
 